#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтруктураПодчиненности_Провести(Команда)
	
	ПровестиТекущий();
	ОповеститьОбИзмененииДокумента();
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненности_ОтменитьПроведение(Команда)
	
	ОтменитьПроведение();
	ОповеститьОбИзмененииДокумента();
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненности_УстановитьСнятьПометкуУдаления(Команда)
	
	УстановитьСнятьПометкуУдаления();
	ОповеститьОбИзмененииДокумента();
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПровестиТекущий()
	
	ТекущийОбъект = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ТекущийОбъект.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьПометкуУдаления()
	
	ТекущийОбъект = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ТекущийОбъект.ПолучитьОбъект();
	Объект.ПометкаУдаления = НЕ Объект.ПометкаУдаления;
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведение()
	
	ТекущийОбъект = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ТекущийОбъект.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииДокумента()
	
	ТекущийОбъект = Элементы.ТаблицаОтчета.ТекущаяОбласть.Расшифровка;
	
	Если ЗначениеЗаполнено(ТекущийОбъект) Тогда
		ОповеститьОбИзменении(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти